src/Documents/ПоступлениеКоробокДляРазбора/ПоступлениеКоробокДляРазбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеКоробокДляРазбора</name>
  <registerRecords>InformationRegister.ОчередьРазбора</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Коробки</name>
    <attributes>
      <name>Коробка</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Предупреждение</name>
      <type>
        <types>EnumRef.ПредупрежденияПрихода</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ОчередьРазбора/ОчередьРазбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьРазбора</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКоробки</types>
    </type>
  </resources>
  <dimensions>
    <name>Коробка</name>
    <type>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыКоробки/СтатусыКоробки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКоробки</name>
  <enumValues>
    <name>ВОчереди</name>
  </enumValues>
  <enumValues>
    <name>Разобрана</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПоступлениеКоробокДляРазбора/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Константы.ПроверятьОтветственногоПриРасходе.Получить() Тогда
		ПроверяемыеРеквизиты.Добавить("Ответственный");	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	мОстанавливатьПриходПриОшибке=Константы.ОстанавливатьПриходПриОшибке.Получить();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеКоробокДляРазбораКоробки.Коробка
		|ИЗ
		|	Документ.ПоступлениеКоробокДляРазбора.Коробки КАК ПоступлениеКоробокДляРазбораКоробки
		|ГДЕ
		|	ПоступлениеКоробокДляРазбораКоробки.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеКоробокДляРазбораКоробки.Коробка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Движения.ОчередьРазбора.Записывать = Истина;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ОчередьРазбора.Добавить();
		Движение.Период=Ссылка.Дата;
		Движение.Коробка = ВыборкаДетальныеЗаписи.Коробка;
		Движение.Статус	 = Перечисления.СтатусыКоробки.ВОчереди;
	КонецЦикла;
	

КонецПроцедуры
